hyeonje0/NRF52840_ble_app_uart/main.c
    memset(&init, 0, sizeof(init));

    init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_LIMITED_DISC_MODE;

    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;
    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}
 

static void repeated_timer_handler(void * p_context)
{
    if(time > 10000) {
        // 반복해서 수행할 코드
      
        time = 0;
    }
    else {
        time++;
    }
    
}

static void create_timers()
{
    ret_code_t err_code;

    // Create timers
    err_code = app_timer_create(&m_repeated_timer_id,
                                APP_TIMER_MODE_REPEATED,
                                repeated_timer_handler);
    APP_ERROR_CHECK(err_code);
}


/* LiDAR Setting2
static void uart_init(void)
{
    uint32_t err_code;
    
    const app_uart_comm_params_t comm_params =
      {
          RX_PIN_NUMBER,
          TX_PIN_NUMBER,
          RTS_PIN_NUMBER,
          CTS_PIN_NUMBER,
          UART_HWFC,
          false,
#if defined (UART_PRESENT)
          NRF_UART_BAUDRATE_115200
#else
          NRF_UARTE_BAUDRATE_115200
#endif
      };

    APP_UART_FIFO_INIT(&comm_params,
                         UART_RX_BUF_SIZE,
                         UART_TX_BUF_SIZE,
                         uart_error_handle,
                         APP_IRQ_PRIORITY_LOWEST,
                         err_code);

    APP_ERROR_CHECK(err_code);
}



void uart_LiDAR(void){
        #ifndef ENABLE_LOOPBACK_TEST
        printf("\r\nUART started.\r\n");
        
        while (true)
        {
          
        }
        TFLiDAR(buf);
        
    #else

        // This part of the example is just for testing the loopback .
        while (true)
        {
            uart_loopback_test();
        }
    #endif
}
*/

static uint8_t index = 0;
char data_array[BLE_NUS_MAX_DATA_LEN];

__STATIC_INLINE void data_handler(uint8_t* temp)
{

    uint32_t       err_code;
    NRF_LOG_INFO(">>> %d %d", temp[0], temp[1]);
    int16_t bit = (temp[0] << 8) | temp[1];
    int16_t temperature = bit * 0.0078125; 
    data_array[index] = temperature;
    sprintf(data_array, "%d", temperature);
    printf("%d\r\n", data_array[index]);
    index++;

    //NRF_LOG_INFO("Temperature: %d Celsius degrees.", temperature);

    //uint16_t device_id_registar = (temp[0] << 8) | temp[1];
    //uint8_t revision = (device_id_registar >> 12) & 0x0f;
    //uint16_t device_id = device_id_registar & 0x0fff;

    //NRF_LOG_INFO("Revision : %x", revision);
    //NRF_LOG_INFO("Device ID : %x", device_id);
}

/**
 * @brief TWI events handler.
 */
void twi_handler(nrf_drv_twi_evt_t const * p_event, void * p_context)
{
    switch (p_event->type)
    {
        case NRF_DRV_TWI_EVT_DONE:
            if (p_event->xfer_desc.type == NRF_DRV_TWI_XFER_RX)
            {
                data_handler(m_sample);
            }
            m_xfer_done = true;
            break;
        default:
            break;
    }
}

void twi_init (void)
{
    ret_code_t err_code;

    const nrf_drv_twi_config_t twi_TMP117_config = {
       .scl                = ARDUINO_SCL_PIN,
       .sda                = ARDUINO_SDA_PIN,
       .frequency          = NRF_DRV_TWI_FREQ_100K,
       .interrupt_priority = APP_IRQ_PRIORITY_HIGH,
       .clear_bus_init     = false
    };

    err_code = nrf_drv_twi_init(&m_twi, &twi_TMP117_config, twi_handler, NULL);
    APP_ERROR_CHECK(err_code);

    nrf_drv_twi_enable(&m_twi);
}

static void write_sensor_data(){
    uint8_t DeviceID = 0x00;
    ret_code_t err_code = nrf_drv_twi_tx(&m_twi, TMP117_ADDR, &DeviceID, sizeof(DeviceID), false);
    APP_ERROR_CHECK(err_code);
}

static void read_sensor_data()
{
    m_xfer_done = false;

    ret_code_t err_code = nrf_drv_twi_rx(&m_twi, TMP117_ADDR, m_sample, sizeof(m_sample));
    APP_ERROR_CHECK(err_code);
}

void ble_mobile(void){
    ret_code_t      err_code;
    if (index > 1)
    {
        NRF_LOG_DEBUG("ble gogogogo");
        NRF_LOG_HEXDUMP_DEBUG(data_array, index);

        do
        {
            uint16_t length = (uint16_t)index;
            err_code = ble_nus_data_send(&m_nus, data_array, &length, m_conn_handle);
            if ((err_code != NRF_ERROR_INVALID_STATE) &&
                (err_code != NRF_ERROR_RESOURCES) &&
                (err_code != NRF_ERROR_NOT_FOUND))
            {
                APP_ERROR_CHECK(err_code);
            }
        } while (err_code == NRF_ERROR_RESOURCES);
    }
    memset(data_array, 0, sizeof(int) * index);
}

/**@brief Application main function.
 */
int main(void)
{
    bool erase_bonds;

    // Initialize.
    log_init();
    timers_init();
    create_timers();
    
    buttons_leds_init(&erase_bonds);
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
  
    ret_code_t      err_code;
    err_code = app_timer_start(m_repeated_timer_id, APP_TIMER_TICKS(1), NULL);
    APP_ERROR_CHECK(err_code);
    
    //uart_LiDAR();

    twi_init();
    write_sensor_data();
    //uart_init();
    
    // Start execution.
    //printf("\r\nUART started.\r\n");
    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    advertising_start();

  
    // Enter main loop.
    for (;;)
    {
        nrf_delay_ms(1000);
        read_sensor_data();
        ble_mobile();
        idle_state_handle();
    }
}